benchmark-results/20260405-171856/01-plain-direct/raw.log
Json file /out/results.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  43 secs]  0 threads 50 conns:    20000000 ops,  494971 (avg:  463848) ops/sec, 20.50MB/sec (avg: 19.22MB/sec),  0.40 (avg:  0.43) msec latency

4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        42537.94          ---          ---         0.43273         0.41500         1.31100         2.60700      3277.07 
Gets       425374.74       175.16    425199.57         0.43116         0.41500         1.31100         2.59100     16575.32 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     467912.68       175.16    425199.57         0.43130         0.41500         1.31100         2.59100     19852.39 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.015        0.000
SET       0.127        5.000
SET       0.207       10.000
SET       0.255       15.000
SET       0.295       20.000
SET       0.327       25.000
SET       0.351       30.000
SET       0.375       35.000
SET       0.383       40.000
SET       0.399       45.000
SET       0.415       50.000
SET       0.423       52.500
SET       0.423       55.000
SET       0.431       57.500
SET       0.439       60.000
SET       0.447       62.500
SET       0.455       65.000
SET       0.463       67.500
SET       0.471       70.000
SET       0.479       72.500
SET       0.487       75.000
SET       0.495       76.250
SET       0.503       77.500
SET       0.511       78.750
SET       0.519       80.000
SET       0.527       81.250
SET       0.535       82.500
SET       0.551       83.750
SET       0.567       85.000
SET       0.583       86.250
SET       0.599       87.500
SET       0.607       88.125
SET       0.623       88.750
SET       0.631       89.375
SET       0.647       90.000
SET       0.663       90.625
SET       0.679       91.250
SET       0.695       91.875
SET       0.711       92.500
SET       0.727       93.125
SET       0.751       93.750
SET       0.759       94.062
SET       0.775       94.375
SET       0.783       94.688
SET       0.799       95.000
SET       0.815       95.312
SET       0.831       95.625
SET       0.855       95.938
SET       0.879       96.250
SET       0.903       96.562
SET       0.927       96.875
SET       0.943       97.031
SET       0.959       97.188
SET       0.975       97.344
SET       0.991       97.500
SET       1.007       97.656
SET       1.031       97.812
SET       1.055       97.969
SET       1.079       98.125
SET       1.111       98.281
SET       1.143       98.438
SET       1.159       98.516
SET       1.175       98.594
SET       1.199       98.672
SET       1.215       98.750
SET       1.239       98.828
SET       1.271       98.906
SET       1.303       98.984
SET       1.343       99.062
SET       1.383       99.141
SET       1.431       99.219
SET       1.463       99.258
SET       1.487       99.297
SET       1.527       99.336
SET       1.559       99.375
SET       1.591       99.414
SET       1.631       99.453
SET       1.679       99.492
SET       1.727       99.531
SET       1.783       99.570
SET       1.831       99.609
SET       1.863       99.629
SET       1.895       99.648
SET       1.927       99.668
SET       1.959       99.688
SET       1.991       99.707
SET       2.031       99.727
SET       2.079       99.746
SET       2.111       99.766
SET       2.159       99.785
SET       2.223       99.805
SET       2.255       99.814
SET       2.287       99.824
SET       2.319       99.834
SET       2.351       99.844
SET       2.399       99.854
SET       2.431       99.863
SET       2.463       99.873
SET       2.511       99.883
SET       2.559       99.893
SET       2.623       99.902
SET       2.655       99.907
SET       2.687       99.912
SET       2.719       99.917
SET       2.751       99.922
SET       2.815       99.927
SET       2.847       99.932
SET       2.895       99.937
SET       2.959       99.941
SET       3.007       99.946
SET       3.087       99.951
SET       3.119       99.954
SET       3.167       99.956
SET       3.215       99.958
SET       3.279       99.961
SET       3.343       99.963
SET       3.391       99.966
SET       3.439       99.968
SET       3.519       99.971
SET       3.583       99.973
SET       3.727       99.976
SET       3.775       99.977
SET       3.807       99.978
SET       3.823       99.979
SET       3.903       99.980
SET       3.967       99.982
SET       3.999       99.983
SET       4.095       99.984
SET       4.159       99.985
SET       4.287       99.987
SET       4.415       99.988
SET       4.447       99.988
SET       4.575       99.989
SET       4.703       99.990
SET       4.895       99.990
SET       4.959       99.991
SET       5.119       99.991
SET       5.375       99.992
SET       5.695       99.993
SET       6.399       99.993
SET      13.567       99.994
SET      13.695       99.994
SET      13.823       99.995
SET      13.887       99.995
SET      14.015       99.995
SET      14.143       99.995
SET      14.271       99.996
SET      14.335       99.996
SET      14.527       99.996
SET      14.655       99.997
SET      14.783       99.997
SET      14.847       99.997
SET      14.847       99.997
SET      14.911       99.997
SET      14.911       99.998
SET      14.975       99.998
SET      14.975       99.998
SET      14.975       99.998
SET      15.039       99.998
SET      15.103       99.998
SET      15.103       99.998
SET      15.103       99.999
SET      15.103       99.999
SET      15.167       99.999
SET      15.167       99.999
SET      15.167       99.999
[...]
SET      15.231       99.999
SET      15.231       99.999
SET      15.295       99.999
SET      15.295       99.999
SET      15.295       99.999
[...]
SET      15.359       99.999
SET      15.359       99.999
SET      15.359      100.000
SET      15.423      100.000
SET      15.423      100.000
SET      15.487      100.000
SET      15.487      100.000
SET      15.487      100.000
[...]
SET      15.551      100.000
SET      15.551      100.000
SET      15.551      100.000
[...]
SET      15.615      100.000
SET      15.615      100.000
SET      15.615      100.000
[...]
SET      15.871      100.000
SET      15.871      100.000
SET      15.871      100.000
[...]
SET      15.935      100.000
SET      15.935      100.000
---
GET       0.015        0.000
GET       0.127        5.000
GET       0.207       10.000
GET       0.255       15.000
GET       0.287       20.000
GET       0.327       25.000
GET       0.351       30.000
GET       0.375       35.000
GET       0.383       40.000
GET       0.399       45.000
GET       0.415       50.000
GET       0.423       52.500
GET       0.423       55.000
GET       0.431       57.500
GET       0.439       60.000
GET       0.447       62.500
GET       0.455       65.000
GET       0.463       67.500
GET       0.471       70.000
GET       0.479       72.500
GET       0.487       75.000
GET       0.495       76.250
GET       0.503       77.500
GET       0.511       78.750
GET       0.519       80.000
GET       0.527       81.250
GET       0.535       82.500
GET       0.551       83.750
GET       0.567       85.000
GET       0.583       86.250
GET       0.599       87.500
GET       0.607       88.125
GET       0.623       88.750
GET       0.631       89.375
GET       0.647       90.000
GET       0.663       90.625
GET       0.671       91.250
GET       0.687       91.875
GET       0.711       92.500
GET       0.727       93.125
GET       0.743       93.750
GET       0.759       94.062
GET       0.767       94.375
GET       0.783       94.688
GET       0.799       95.000
GET       0.815       95.312
GET       0.831       95.625
GET       0.855       95.938
GET       0.871       96.250
GET       0.895       96.562
GET       0.927       96.875
GET       0.935       97.031
GET       0.951       97.188
GET       0.967       97.344
GET       0.991       97.500
GET       1.007       97.656
GET       1.031       97.812
GET       1.047       97.969
GET       1.079       98.125
GET       1.103       98.281
GET       1.135       98.438
GET       1.151       98.516
GET       1.175       98.594
GET       1.191       98.672
GET       1.215       98.750
GET       1.239       98.828
GET       1.271       98.906
GET       1.303       98.984
GET       1.335       99.062
GET       1.383       99.141
GET       1.431       99.219
GET       1.455       99.258
GET       1.487       99.297
GET       1.519       99.336
GET       1.551       99.375
GET       1.583       99.414
GET       1.631       99.453
GET       1.671       99.492
GET       1.719       99.531
GET       1.767       99.570
GET       1.823       99.609
GET       1.847       99.629
GET       1.879       99.648
GET       1.911       99.668
GET       1.943       99.688
GET       1.975       99.707
GET       2.007       99.727
GET       2.047       99.746
GET       2.095       99.766
GET       2.143       99.785
GET       2.191       99.805
GET       2.223       99.814
GET       2.255       99.824
GET       2.287       99.834
GET       2.335       99.844
GET       2.367       99.854
GET       2.415       99.863
GET       2.463       99.873
GET       2.495       99.883
GET       2.559       99.893
GET       2.607       99.902
GET       2.639       99.907
GET       2.671       99.912
GET       2.703       99.917
GET       2.751       99.922
GET       2.783       99.927
GET       2.815       99.932
GET       2.863       99.937
GET       2.911       99.941
GET       2.959       99.946
GET       3.007       99.951
GET       3.039       99.954
GET       3.071       99.956
GET       3.103       99.958
GET       3.151       99.961
GET       3.199       99.963
GET       3.231       99.966
GET       3.279       99.968
GET       3.359       99.971
GET       3.407       99.973
GET       3.487       99.976
GET       3.535       99.977
GET       3.567       99.978
GET       3.615       99.979
GET       3.647       99.980
GET       3.695       99.982
GET       3.743       99.983
GET       3.775       99.984
GET       3.823       99.985
GET       3.887       99.987
GET       3.935       99.988
GET       3.967       99.988
GET       4.015       99.989
GET       4.063       99.990
GET       4.127       99.990
GET       4.191       99.991
GET       4.223       99.991
GET       4.287       99.992
GET       4.351       99.993
GET       4.447       99.993
GET       4.511       99.994
GET       4.575       99.994
GET       4.639       99.995
GET       4.703       99.995
GET       4.735       99.995
GET       4.799       99.995
GET       4.863       99.996
GET       4.927       99.996
GET       4.991       99.996
GET       5.087       99.997
GET       5.183       99.997
GET       5.215       99.997
GET       5.279       99.997
GET       5.343       99.997
GET       5.375       99.998
GET       5.439       99.998
GET       5.567       99.998
GET       5.759       99.998
GET       5.855       99.998
GET       6.015       99.998
GET       6.207       99.998
GET       6.239       99.999
GET       6.271       99.999
GET       6.335       99.999
GET       6.399       99.999
GET       6.399       99.999
GET       6.463       99.999
GET       6.687       99.999
GET       6.783       99.999
GET       7.071       99.999
GET       7.647       99.999
GET       7.935       99.999
GET       8.383       99.999
GET       8.767       99.999
GET      10.623       99.999
GET      10.687       99.999
GET      10.879       99.999
GET      11.519      100.000
GET      11.839      100.000
GET      12.223      100.000
GET      12.415      100.000
GET      12.415      100.000
GET      12.479      100.000
GET      12.479      100.000
GET      12.479      100.000
GET      12.543      100.000
GET      12.607      100.000
GET      12.607      100.000
GET      12.863      100.000
GET      12.863      100.000
GET      12.927      100.000
GET      12.927      100.000
GET      12.927      100.000
[...]
GET      13.055      100.000
GET      13.247      100.000
GET      13.247      100.000
GET      13.439      100.000
GET      13.503      100.000
GET      13.503      100.000
GET      13.503      100.000
GET      13.567      100.000
GET      13.567      100.000
GET      13.631      100.000
GET      13.631      100.000
GET      13.631      100.000
[...]
GET      13.695      100.000
GET      13.695      100.000
GET      13.695      100.000
[...]
GET      13.759      100.000
GET      13.759      100.000
GET      13.759      100.000
[...]
GET      13.887      100.000
GET      13.887      100.000
GET      13.887      100.000
[...]
GET      13.951      100.000
GET      13.951      100.000
---
WAIT      0.000      100.000
Saving JSON output file: /out/results.json
Json file closed.